tutorials/NN/02compBump/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            fixedValue;
        value        uniform (0 0 0);
    }

    bottom
    {
        type            fixedValue;
        value        uniform (0 0 0);
    }

    inlet
    {
        type            fixedValue;
        value        uniform (0 0 0);
    }

    outlet
    {
        type            fixedValue;
        value        uniform (0 0 0);
    }

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }
}


// ************************************************************************* //